for n in range(3, 1000, 3):
    # n - начальная длина строки. Поскольку цифр поровну,
    # идем по длине строки 3, 6, 9 ...
    s = '1' * (n // 3) + '2' * (n // 3) + '3' * (n // 3)
    while '21' in s or '31' in s or '32' in s:
        if '21' in s:
            s = s.replace('21', '12', 1)
        if '31' in s:
            s = s.replace('31', '13', 1)
        if '32' in s:
            s = s.replace('32', '23', 1)
    # по условию задачи, нумерация идет с 1
    if len(s) >= 139 and s[10 - 1] == s[80 - 1] == s[140 - 1]:
        print(n)
        break
