# Пусть М – сумма минимального и максимального простых натуральных делителей целого числа, не считая самого числа.
# Если таких делителей у числа нет, то значение М считается равным нулю. Напишите программу,
# которая перебирает целые числа, бо́льшие 8 007 524 668, в порядке возрастания и ищет среди них такие,
# для которых М больше 110 000, является простым числом и в своём написании содержит последовательность цифр 991
# (991 – идущие подряд друг за другом в указанном порядке цифры 9, 9 и 1) ровно один раз.
#
# В ответе запишите в первом столбце таблицы первые 5 найденных чисел в порядке возрастания,
# а во втором столбце – соответствующие им значения М.

# Проверка, является ли число простым
def is_prime(x):
    for k in range(2, int(x**0.5) + 1):
        if x % k == 0:
            return False
    return True

# Функция нахождения всех делителей числа
def divs(x):
    d = set()
    for k in range(2, int(x**0.5) + 1):
        if x % k == 0:
            d.add(k)
            d.add(x // k)
    return sorted(d)


c = 0  # счетчик найденных чисел
for n in range(8_007_524_669, 9_000_000_000):
    d = [i for i in divs(n) if is_prime(i)]  # все простые делители числа
    if d:
        m = min(d) + max(d)
        if m > 110_000 and is_prime(m) and str(m).count('991') == 1:
            print(n, m)
            c += 1
    if c == 5:
        break

# 8007539144 149911 [2, 11, 607, 149909]
# 8007540788 153991171 [2, 13, 153991169]
# 8007540856 142991803 [2, 7, 142991801]
# 8007547448 9910333 [2, 101, 9910331]