# Текстовый файл состоит из цифр 0, 1, 2, 3, 4 и знаков арифметических операций «–» и «*»
# (вычитание и умножение).
# Определите максимальное количество символов в непрерывной последовательности,
# которая является корректным арифметическим выражением с целыми неотрицательными числами.
# В этом выражении никакие два знака арифметических операций не стоят рядом,
# в записи чисел отсутствуют незначащие (ведущие) нули и число 0 не имеет знака.

s = open('737070.txt').read().strip()
mx = 0
# print(len(s))
for l in range(len(s)):
    # print(l, len(s))
    if s[l] == '0' or s[l] == '-':
        continue
    for r in range(l + mx, len(s)):
        t = s[l:r]
        # print(t)
        if '--' in t or '**' in t or '-*' in t or '*-' in t:
            break
        f = False
        for c in '01234':
            if '-0' + c in t:
                f = True
                break
            if '*0' + c in t:
                f = True
                break
        if f:
            break
        mx = max(mx, len(t))
print(mx)

